iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res12[680];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_PID4;

  uint8_t res13[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_PID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_PID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_PID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_PID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_CID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_CID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_CID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCS_CID3;

  uint8_t res14[983040];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_SCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_DWT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_BPU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_END;

  uint8_t res15[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_CSMT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_PID4;

  uint8_t res16[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_PID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_PID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_PID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_PID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_CID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_CID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_CID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_CID3;

};

#define Cortex_M0 (*(volatile struct Cortex_M0_tag *) 0xe0001fd0)

struct Core_Debug_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALTED:1;
      uint64_t BKPT:1;
      uint64_t DWTRAP:1;
      uint64_t VCATCH:1;
      uint64_t EXTERNAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSR;

  uint8_t res0[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C_DEBUGEN:1;
      uint64_t reservedSpace0:15;
      uint64_t S_REGRDYDBGKEY:1;
      uint64_t S_HALTDBGKEY:1;
      uint64_t DBGKEY_0:1;
      uint64_t DBGKEY_1:1;
      uint64_t DBGKEY_2:1;
      uint64_t DBGKEY_3:1;
      uint64_t DBGKEY_4:1;
      uint64_t DBGKEY_5:1;
      uint64_t S_RETIRE_STDBGKEY:1;
      uint64_t S_RESET_STDBGKEY:1;
      uint64_t DBGKEY_6:1;
      uint64_t DBGKEY_7:1;
      uint64_t DBGKEY_8:1;
      uint64_t DBGKEY_9:1;
      uint64_t DBGKEY_10:1;
      uint64_t DBGKEY_11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DHCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGSEL:5;
      uint64_t reservedSpace0:11;
      uint64_t REGWnR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCRSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCRDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VC_CORERESET:1;
      uint64_t reservedSpace0:9;
      uint64_t VC_HARDERR:1;
      uint64_t reservedSpace1:13;
      uint64_t DWTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEMCR;

};

#define Core_Debug (*(volatile struct Core_Debug_tag *) 0xe000ed30)

struct Debug_Components_tag
{
  uint32_t SCS;
  uint32_t DW;
  uint32_t BPU;
  uint32_t END;
  uint8_t res0[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PartNumber:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEMTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEP106CC:4;
      uint64_t PartNumber_0:8;
      uint64_t PartNumber_1:4;
      uint64_t JEP106ID_0:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t KBCOUNT:4;
      uint64_t JEP106ID_1:4;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PartNumber_0:8;
      uint64_t PartNumber_1:4;
      uint64_t JEP106ID_0:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t JEP106ID_1:4;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PartNumber_0:8;
      uint64_t PartNumber_1:4;
      uint64_t JEP106ID_0:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t JEP106ID_1:4;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PartNumber_0:8;
      uint64_t PartNumber_1:4;
      uint64_t JEP106ID_0:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t JEP106ID_1:4;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PartNumber_0:8;
      uint64_t PartNumber_1:4;
      uint64_t JEP106ID_0:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t JEP106ID_1:4;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PartNumber:4;
      uint64_t JEP106ID_0:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t JEP106ID_1:4;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEP106ID:3;
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t JEP106USED:1;
      uint64_t REV:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM:4;
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t REVAND:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE_0:8;
      uint64_t PREAMBLE_1:4;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPONENT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE_0:4;
      uint64_t PREAMBLE_1:8;
      uint64_t COMPCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPONENT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPONENT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPONENT3;

