iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define Debug_Components (*(volatile struct Debug_Components_tag *) 0xe00ff000)

struct Breakpoint_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t KEY:1;
      uint64_t reservedSpace0:2;
      uint64_t NUM_CODE1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BP_CTRL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP:27;
      uint64_t reservedSpace1:1;
      uint64_t BP_MATCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B_COMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP:27;
      uint64_t reservedSpace1:1;
      uint64_t BP_MATCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B_COMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP:27;
      uint64_t reservedSpace1:1;
      uint64_t BP_MATCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B_COMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP:27;
      uint64_t reservedSpace1:1;
      uint64_t BP_MATCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B_COMP3;

};

#define Breakpoint_Unit (*(volatile struct Breakpoint_Unit_tag *) 0xe0002000)

struct Data_Watchpoint_and_Trace_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t NUM_CODE1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_CTRL;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIASAMPLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_PCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:32;
      uint64_t MASK:5;
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_COMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_FUNCTION0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:32;
      uint64_t MASK:5;
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_COMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DW_FUNCTION1;

};

#define Data_Watchpoint_and_Trace_Unit (*(volatile struct Data_Watchpoint_and_Trace_Unit_tag *) 0xe0001000)

struct SFLASH_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW03;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW04;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW05;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW06;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW07;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW08;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW09;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_ROW63;

  uint8_t res0[63];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT_LEVEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_PROTECTION;

  uint8_t res1[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AV_PAIRS_32B15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUSS_WOUNDING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SILICON_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUSS_PRIV_RAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUSS_PRIV_FLASH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WAKEUP_HOLDOFF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HIB_KEY_DELAY;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WAKEUP_HOLDOFF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DPSLP_KEY_DELAY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWD_SELECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SWD_CONFIG;

  uint8_t res2[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CYCLES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWD_LISTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_START;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRIM8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CSD_TRIM1_HVIDAC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRIM8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CSD_TRIM2_HVIDAC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRIM8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CSD_TRIM1_CSD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRIM8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CSD_TRIM2_CSD;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TEMP_MULTIPLIER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SAR_TEMP_MULTIPLIER;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TEMP_OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SAR_TEMP_OFFSET;

  uint8_t res3[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SKIP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SKIP_CHECKSUM;

  uint8_t res4[6];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PROT_VIRGINKEY7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_LOT0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_LOT1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_LOT2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WAFER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_WAFER;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t X:6;
      uint64_t CRI_PASS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_X;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t Y:6;
      uint64_t CHI_PASS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_Y;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t S1_PASS:2;
      uint64_t S2_PASS:2;
      uint64_t S3_PASS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_SORT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MINOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DIE_MINOR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA03;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA04;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA05;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA06;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA07;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA08;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA09;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA23;

