iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PE_TE_DATA31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EA_E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EA_P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ES_E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:24;
      uint64_t PDAC:4;
      uint64_t NDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ES_P_EO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VCTAT_SLOPE:4;
      uint64_t VCTAT_VOLTAGE:2;
      uint64_t VCTAT_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) E_VCTAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VCTAT_SLOPE:4;
      uint64_t VCTAT_VOLTAGE:2;
      uint64_t VCTAT_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) P_VCTAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MDAC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MARGIN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BDAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SPCIF_TRIM1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MAXFREQ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_MAXF0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ABS_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_ABS0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TMPCO_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TMPCO0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MAXFREQ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_MAXF1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ABS_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_ABS1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TMPCO_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TMPCO1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MAXFREQ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_MAXF2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ABS_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_ABS2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TMPCO_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TMPCO2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MAXFREQ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_MAXF3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ABS_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_ABS3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TMPCO_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TMPCO3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ABS_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_ABS4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TMPCO_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TMPCO4;

  uint8_t res5[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM03;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM04;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM05;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM06;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM07;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM08;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM09;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMO_TRIM45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHECKSUM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHECKSUM;

