iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define SFLASH (*(volatile struct SFLASH_tag *) 0xffff000)

struct CPUSS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECS_IN_RAM:1;
      uint64_t FLSH_ACC_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMMAND:16;
      uint64_t reservedSpace0:11;
      uint64_t NO_RST_OVR:1;
      uint64_t PRIVILEGED:1;
      uint64_t ROM_ACCESS_EN:1;
      uint64_t HMASTER:1;
      uint64_t SYSREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARG32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSARG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROT:4;
      uint64_t reservedSpace0:27;
      uint64_t PROT_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROTECTION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROM_LIMIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_ROM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_LIMIT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_RAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_LIMIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_FLASH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_SIZE:9;
      uint64_t reservedSpace0:7;
      uint64_t RAM_WOUND:3;
      uint64_t reservedSpace1:1;
      uint64_t FLASH_WOUND:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WOUNDING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELECT32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SELECT;

};

#define CPUSS (*(volatile struct CPUSS_tag *) 0x40000000)

struct HSIOM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:4;
      uint64_t SEL1:4;
      uint64_t SEL2:4;
      uint64_t SEL3:4;
      uint64_t SEL4:4;
      uint64_t SEL5:4;
      uint64_t SEL6:4;
      uint64_t SEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:4;
      uint64_t SEL1:4;
      uint64_t SEL2:4;
      uint64_t SEL3:4;
      uint64_t SEL4:4;
      uint64_t SEL5:4;
      uint64_t SEL6:4;
      uint64_t SEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:4;
      uint64_t SEL1:4;
      uint64_t SEL2:4;
      uint64_t SEL3:4;
      uint64_t SEL4:4;
      uint64_t SEL5:4;
      uint64_t SEL6:4;
      uint64_t SEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:4;
      uint64_t SEL1:4;
      uint64_t SEL2:4;
      uint64_t SEL3:4;
      uint64_t SEL4:4;
      uint64_t SEL5:4;
      uint64_t SEL6:4;
      uint64_t SEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:4;
      uint64_t SEL1:4;
      uint64_t SEL2:4;
      uint64_t SEL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL4;

};

#define HSIOM (*(volatile struct HSIOM_tag *) 0x40010000)

struct CLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_A:16;
      uint64_t reservedSpace0:15;
      uint64_t ENABLE_A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_A00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_A:16;
      uint64_t reservedSpace0:15;
      uint64_t ENABLE_A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_A01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_A:16;
      uint64_t reservedSpace0:15;
      uint64_t ENABLE_A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_A02;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_B:16;
      uint64_t reservedSpace0:14;
      uint64_t CASCADE_A_B:1;
      uint64_t ENABLE_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_B00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_B:16;
      uint64_t reservedSpace0:14;
      uint64_t CASCADE_A_B:1;
      uint64_t ENABLE_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_B01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_B:16;
      uint64_t reservedSpace0:14;
      uint64_t CASCADE_A_B:1;
      uint64_t ENABLE_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_B02;

  uint8_t res1[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_C:16;
      uint64_t reservedSpace0:14;
      uint64_t CASCADE_B_C:1;
      uint64_t ENABLE_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_C00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_C:16;
      uint64_t reservedSpace0:14;
      uint64_t CASCADE_B_C:1;
      uint64_t ENABLE_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_C01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_C:16;
      uint64_t reservedSpace0:14;
      uint64_t CASCADE_B_C:1;
      uint64_t ENABLE_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_C02;

  uint8_t res2[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_A:16;
      uint64_t FRAC_A:5;
      uint64_t reservedSpace0:10;
      uint64_t ENABLE_A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_FRAC_A00;

  uint8_t res3[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_B:16;
      uint64_t FRAC_B:5;
      uint64_t reservedSpace0:9;
      uint64_t CASCADE_A_B:1;
      uint64_t ENABLE_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_FRAC_B00;

  uint8_t res4[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_C:16;
      uint64_t FRAC_C:5;
      uint64_t reservedSpace0:9;
      uint64_t CASCADE_B_C:1;
      uint64_t ENABLE_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER_FRAC_C00;

  uint8_t res5[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDER_N:4;
      uint64_t DIVIDER_ABC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELECT15;

