iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define CLK (*(volatile struct CLK_tag *) 0x40020000)

struct TST_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAP_NO_ACCESS:1;
      uint64_t DAP_NO_DEBUG:1;
      uint64_t SWD_CONNECTED:1;
      uint64_t reservedSpace0:5;
      uint64_t TEST_RESET_EN_N:1;
      uint64_t TEST_SET_EN_N:1;
      uint64_t TEST_ICG_EN_N:1;
      uint64_t TEST_OCC0_1_EN_N:1;
      uint64_t TEST_OCC0_2_EN_N:1;
      uint64_t TEST_SLPISOLATE_EN:1;
      uint64_t TEST_SYSISOLATE_EN:1;
      uint64_t TEST_SLPRETAIN_EN:1;
      uint64_t TEST_SYSRETAIN_EN:1;
      uint64_t TEST_SPARE1_EN:1;
      uint64_t TEST_SPARE2_EN:1;
      uint64_t reservedSpace1:5;
      uint64_t SCAN_OCC_OBSERVE:1;
      uint64_t SCAN_TRF1:1;
      uint64_t SCAN_TRF:1;
      uint64_t SCAN_IDDQ:1;
      uint64_t SCAN_COMPRESS:1;
      uint64_t SCAN_MODE:1;
      uint64_t PTM_MODE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADFT_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_SEL1:6;
      uint64_t reservedSpace0:2;
      uint64_t DFT_SEL2:6;
      uint64_t reservedSpace1:14;
      uint64_t EDGE:1;
      uint64_t DIVIDE:2;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDFT_CTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SWD_CONNECTED:1;
      uint64_t reservedSpace1:28;
      uint64_t TEST_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
      uint64_t reservedSpace0:15;
      uint64_t COUNTER_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_CNTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_CNTR2;

};

#define TST (*(volatile struct TST_tag *) 0x40030000)

struct PRT_PRT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAREG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSTATE:8;
      uint64_t PINSTATE_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DM:24;
      uint64_t VTRIP_SEL:1;
      uint64_t SLOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTYPE:16;
      uint64_t INTTYPE_FLT:2;
      uint64_t FLT_SELECT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSTAT:8;
      uint64_t INTSTAT_FLT:1;
      uint64_t reservedSpace0:7;
      uint64_t PS:8;
      uint64_t PS_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_DIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC2;

};

#define PRT_PRT0 (*(volatile struct PRT_PRT0_tag *) 0x40040000)

struct PRT_PRT1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAREG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSTATE:8;
      uint64_t PINSTATE_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DM:24;
      uint64_t VTRIP_SEL:1;
      uint64_t SLOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTYPE:16;
      uint64_t INTTYPE_FLT:2;
      uint64_t FLT_SELECT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSTAT:8;
      uint64_t INTSTAT_FLT:1;
      uint64_t reservedSpace0:7;
      uint64_t PS:8;
      uint64_t PS_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_DIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC2;

};

#define PRT_PRT1 (*(volatile struct PRT_PRT1_tag *) 0x40040100)

struct PRT_PRT2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAREG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSTATE:8;
      uint64_t PINSTATE_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DM:24;
      uint64_t VTRIP_SEL:1;
      uint64_t SLOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTYPE:16;
      uint64_t INTTYPE_FLT:2;
      uint64_t FLT_SELECT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSTAT:8;
      uint64_t INTSTAT_FLT:1;
      uint64_t reservedSpace0:7;
      uint64_t PS:8;
      uint64_t PS_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_DIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC2;

};

#define PRT_PRT2 (*(volatile struct PRT_PRT2_tag *) 0x40040200)

struct PRT_PRT3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAREG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSTATE:8;
      uint64_t PINSTATE_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DM:24;
      uint64_t VTRIP_SEL:1;
      uint64_t SLOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTYPE:16;
      uint64_t INTTYPE_FLT:2;
      uint64_t FLT_SELECT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSTAT:8;
      uint64_t INTSTAT_FLT:1;
      uint64_t reservedSpace0:7;
      uint64_t PS:8;
      uint64_t PS_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

