iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_DIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC2;

};

#define PRT_PRT3 (*(volatile struct PRT_PRT3_tag *) 0x40040300)

struct PRT_PRT4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAREG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSTATE:8;
      uint64_t PINSTATE_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DM:24;
      uint64_t VTRIP_SEL:1;
      uint64_t SLOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTYPE:16;
      uint64_t INTTYPE_FLT:2;
      uint64_t FLT_SELECT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSTAT:8;
      uint64_t INTSTAT_FLT:1;
      uint64_t reservedSpace0:7;
      uint64_t PS:8;
      uint64_t PS_FLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_DIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC2;

};

#define PRT_PRT4 (*(volatile struct PRT_PRT4_tag *) 0x40040400)

struct TCPWM_TCPWM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER_ENABLED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER_CAPTURE:8;
      uint64_t COUNTER_RELOAD:8;
      uint64_t COUNTER_STOP:8;
      uint64_t COUNTER_START:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER_INT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

};

#define TCPWM_TCPWM (*(volatile struct TCPWM_TCPWM_tag *) 0x40050000)

struct TCPWM_TCPWM_CNT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTO_RELOAD_CC:1;
      uint64_t AUTO_RELOAD_PERIOD:1;
      uint64_t PWM_SYNC_KILL:1;
      uint64_t PWM_STOP_ON_KILL:1;
      uint64_t reservedSpace0:4;
      uint64_t GENERIC:8;
      uint64_t UP_DOWN_MODE:2;
      uint64_t ONE_SHOT:1;
      uint64_t reservedSpace1:1;
      uint64_t QUADRATURE_MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GENERIC:8;
      uint64_t reservedSpace1:15;
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC_BUFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD_BUFF;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_SEL:4;
      uint64_t COUNT_SEL:4;
      uint64_t RELOAD_SEL:4;
      uint64_t STOP_SEL:4;
      uint64_t START_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_EDGE:2;
      uint64_t COUNT_EDGE:2;
      uint64_t RELOAD_EDGE:2;
      uint64_t STOP_EDGE:2;
      uint64_t START_EDGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC_MATCH_MODE:2;
      uint64_t OVERFLOW_MODE:2;
      uint64_t UNDERFLOW_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define TCPWM_TCPWM_CNT0 (*(volatile struct TCPWM_TCPWM_CNT0_tag *) 0x40050100)

struct TCPWM_TCPWM_CNT1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTO_RELOAD_CC:1;
      uint64_t AUTO_RELOAD_PERIOD:1;
      uint64_t PWM_SYNC_KILL:1;
      uint64_t PWM_STOP_ON_KILL:1;
      uint64_t reservedSpace0:4;
      uint64_t GENERIC:8;
      uint64_t UP_DOWN_MODE:2;
      uint64_t ONE_SHOT:1;
      uint64_t reservedSpace1:1;
      uint64_t QUADRATURE_MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GENERIC:8;
      uint64_t reservedSpace1:15;
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC_BUFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD_BUFF;

