iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_SEL:4;
      uint64_t COUNT_SEL:4;
      uint64_t RELOAD_SEL:4;
      uint64_t STOP_SEL:4;
      uint64_t START_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_EDGE:2;
      uint64_t COUNT_EDGE:2;
      uint64_t RELOAD_EDGE:2;
      uint64_t STOP_EDGE:2;
      uint64_t START_EDGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC_MATCH_MODE:2;
      uint64_t OVERFLOW_MODE:2;
      uint64_t UNDERFLOW_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define TCPWM_TCPWM_CNT3 (*(volatile struct TCPWM_TCPWM_CNT3_tag *) 0x400501c0)

struct SCB_SCB0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVS:4;
      uint64_t reservedSpace0:4;
      uint64_t EC_AM_MODE:1;
      uint64_t EC_OP_MODE:1;
      uint64_t EZ_MODE:1;
      uint64_t reservedSpace1:5;
      uint64_t ADDR_ACCEPT:1;
      uint64_t BLOCK:1;
      uint64_t reservedSpace2:6;
      uint64_t MODE:2;
      uint64_t reservedSpace3:5;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EC_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTINUOUS:1;
      uint64_t SELECT_PRECEDE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t LATE_MISO_SAMPLE:1;
      uint64_t reservedSpace0:11;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace1:7;
      uint64_t MODE:2;
      uint64_t SLAVE_SELECT:2;
      uint64_t reservedSpace2:3;
      uint64_t MASTER_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUS_BUSY:1;
      uint64_t reservedSpace0:7;
      uint64_t EZ_ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_STATUS;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace1:7;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_BITS:3;
      uint64_t reservedSpace0:1;
      uint64_t PARITY:1;
      uint64_t PARITY_ENABLED:1;
      uint64_t reservedSpace1:2;
      uint64_t RETRY_ON_NACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_TX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_BITS:3;
      uint64_t reservedSpace0:1;
      uint64_t PARITY:1;
      uint64_t PARITY_ENABLED:1;
      uint64_t POLARITY:1;
      uint64_t reservedSpace1:1;
      uint64_t DROP_ON_PARITY_ERROR:1;
      uint64_t DROP_ON_FRAME_ERROR:1;
      uint64_t MP_MODE:1;
      uint64_t reservedSpace2:1;
      uint64_t LIN_MODE:1;
      uint64_t SKIP_START:1;
      uint64_t reservedSpace3:2;
      uint64_t BREAK_WIDTH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_RX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR_COUNTER:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_RX_STATUS;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGH_PHASE_OVS:4;
      uint64_t LOW_PHASE_OVS:4;
      uint64_t M_READY_DATA_ACK:1;
      uint64_t M_NOT_READY_DATA_NACK:1;
      uint64_t reservedSpace0:1;
      uint64_t S_GENERAL_IGNORE:1;
      uint64_t S_READY_ADDR_ACK:1;
      uint64_t S_READY_DATA_ACK:1;
      uint64_t S_NOT_READY_ADDR_NACK:1;
      uint64_t S_NOT_READY_DATA_NACK:1;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace1:13;
      uint64_t SLAVE_MODE:1;
      uint64_t MASTER_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUS_BUSY:1;
      uint64_t reservedSpace0:3;
      uint64_t S_READ:1;
      uint64_t M_READ:1;
      uint64_t reservedSpace1:2;
      uint64_t EZ_ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M_START:1;
      uint64_t M_START_ON_IDLE:1;
      uint64_t M_ACK:1;
      uint64_t M_NACK:1;
      uint64_t M_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_M_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_ACK:1;
      uint64_t S_NACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_S_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDA_FILT_HYS:2;
      uint64_t SDA_FILT_TRIM:2;
      uint64_t SCL_FILT_HYS:2;
      uint64_t SCL_FILT_TRIM:2;
      uint64_t SDA_FILT_OUT_HYS:2;
      uint64_t SDA_FILT_OUT_TRIM:2;
      uint64_t reservedSpace0:4;
      uint64_t SDA_FILT_HS:1;
      uint64_t SDA_FILT_ENABLED:1;
      uint64_t reservedSpace1:6;
      uint64_t SCL_FILT_HS:1;
      uint64_t SCL_FILT_ENABLED:1;
      uint64_t SDA_FILT_OUT_HS:1;
      uint64_t SDA_FILT_OUT_ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CFG;

  uint8_t res3[140];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_ADDR:5;
      uint64_t reservedSpace0:11;
      uint64_t RAM_OP1:2;
      uint64_t RAM_OP2:2;
      uint64_t RAM_OP3:2;
      uint64_t RAM_OP4:2;
      uint64_t RAM_OPCNT:2;
      uint64_t RAM_PREADR:1;
      uint64_t RAM_WORD:1;
      uint64_t RAM_FAIL:1;
      uint64_t RAM_GO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_DATA;

  uint8_t res4[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_WIDTH:4;
      uint64_t reservedSpace0:4;
      uint64_t MSB_FIRST:1;
      uint64_t reservedSpace1:22;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER_LEVEL:3;
      uint64_t reservedSpace0:13;
      uint64_t CLEAR:1;
      uint64_t FREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USED:4;
      uint64_t reservedSpace0:11;
      uint64_t SR_VALID:1;
      uint64_t RD_PTR:3;
      uint64_t reservedSpace1:5;
      uint64_t WR_PTR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FIFO_STATUS;

  uint8_t res5[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FIFO_WR;

