iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res6[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_WIDTH:4;
      uint64_t reservedSpace0:4;
      uint64_t MSB_FIRST:1;
      uint64_t MEDIAN:1;
      uint64_t reservedSpace1:21;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER_LEVEL:3;
      uint64_t reservedSpace0:13;
      uint64_t CLEAR:1;
      uint64_t FREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USED:4;
      uint64_t reservedSpace0:11;
      uint64_t SR_VALID:1;
      uint64_t RD_PTR:3;
      uint64_t reservedSpace1:5;
      uint64_t WR_PTR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_STATUS;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_MATCH;

  uint8_t res8[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_RD_SILENT;

  uint8_t res9[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EZ_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EZ_DATA31;

  uint8_t res10[2432];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M:1;
      uint64_t S:1;
      uint64_t TX:1;
      uint64_t RX:1;
      uint64_t I2C_EC:1;
      uint64_t SPI_EC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

  uint8_t res11[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_I2C_EC;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_I2C_EC_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_I2C_EC_MASKED;

  uint8_t res13[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SPI_EC;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SPI_EC_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SPI_EC_MASKED;

