iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res15[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M_MASKED;

  uint8_t res16[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S_MASKED;

  uint8_t res17[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX_MASKED;

  uint8_t res18[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX_MASKED;

