iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define SCB_SCB1 (*(volatile struct SCB_SCB1_tag *) 0x40070000)

struct CSD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:16;
      uint64_t REVISION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSI_SAMPLE_EN:1;
      uint64_t SAMPLE_SYNC:1;
      uint64_t reservedSpace0:3;
      uint64_t PRS_CLEAR:1;
      uint64_t PRS_SELECT:1;
      uint64_t PRS_12_8:1;
      uint64_t DSI_SENSE_EN:1;
      uint64_t SHIELD_DELAY:2;
      uint64_t SENSE_COMP_BW:1;
      uint64_t SENSE_EN:1;
      uint64_t REFBUF_EN:1;
      uint64_t COMP_MODE:1;
      uint64_t COMP_PIN:1;
      uint64_t POLARITY:1;
      uint64_t POLARITY2:1;
      uint64_t MUTUAL_CAP:1;
      uint64_t SENSE_COMP_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t REBUF_OUTSEL:1;
      uint64_t SENSE_INSEL:1;
      uint64_t REFBUF_DRV:2;
      uint64_t reservedSpace2:1;
      uint64_t DDFTSEL:3;
      uint64_t ADFTEN:1;
      uint64_t DDFTCOMP:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAC1:8;
      uint64_t IDAC1_MODE:2;
      uint64_t IDAC1_RANGE:1;
      uint64_t reservedSpace0:5;
      uint64_t IDAC2:7;
      uint64_t reservedSpace1:1;
      uint64_t IDAC2_MODE:2;
      uint64_t IDAC2_RANGE:1;
      uint64_t reservedSpace2:3;
      uint64_t FEEDBACK_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSD_CHARGE:1;
      uint64_t CSD_SENSE:1;
      uint64_t COMP_OUT:1;
      uint64_t SAMPLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSD_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSD_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  uint8_t res0[65252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAC1_SRC_TRIM:4;
      uint64_t IDAC2_SRC_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAC1_SNK_TRIM:4;
      uint64_t IDAC2_SNK_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM2;

};

#define CSD (*(volatile struct CSD_tag *) 0x40080000)

struct LCD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:16;
      uint64_t REVISION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUBFR_DIV:16;
      uint64_t DEAD_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVIDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LS_EN:1;
      uint64_t HS_EN:1;
      uint64_t LCD_MODE:1;
      uint64_t TYPE:1;
      uint64_t OP_MODE:1;
      uint64_t BIAS:2;
      uint64_t reservedSpace0:1;
      uint64_t COM_NUM:4;
      uint64_t reservedSpace1:19;
      uint64_t LS_EN_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  uint8_t res0[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA04;

};

#define LCD (*(volatile struct LCD_tag *) 0x40090000)

struct LPCOMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:16;
      uint64_t REVISION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE1:2;
      uint64_t HYST1:1;
      uint64_t FILTER1:1;
      uint64_t INTTYPE1:2;
      uint64_t OUT1:1;
      uint64_t ENABLE1:1;
      uint64_t MODE2:2;
      uint64_t HYST2:1;
      uint64_t FILTER2:1;
      uint64_t INTTYPE2:2;
      uint64_t OUT2:1;
      uint64_t ENABLE2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL_EN:1;
      uint64_t BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:1;
      uint64_t COMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:1;
      uint64_t COMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  uint8_t res0[65260];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1_TRIMA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1_TRIMB:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP2_TRIMA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP2_TRIMB:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM4;

};

#define LPCOMP (*(volatile struct LPCOMP_tag *) 0x400a0000)

struct SRSS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER_MODE:4;
      uint64_t DEBUG_SESSION:1;
      uint64_t LPM_READY:1;
      uint64_t reservedSpace0:17;
      uint64_t EXT_VCCD:1;
      uint64_t HVMON_ENABLE:1;
      uint64_t HVMON_RELOAD:1;
      uint64_t reservedSpace1:1;
      uint64_t FIMO_DISABLE:1;
      uint64_t HIBERNATE_DISABLE:1;
      uint64_t LFCLK_SHORT:1;
      uint64_t reservedSpace2:1;
      uint64_t HIBERNATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_HOLDOFF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_KEY_DELAY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HIB_TEST_EN:1;
      uint64_t HIB_TEST_REP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_PWRSYS_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BG_DFT_EN:1;
      uint64_t BG_DFT_VREF_SEL:4;
      uint64_t BG_DFT_CORE_SEL:1;
      uint64_t BG_DFT_ICORE_SEL:2;
      uint64_t BG_DFT_VCORE_SEL:1;
      uint64_t reservedSpace0:7;
      uint64_t VREF_EN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVD_EN:1;
      uint64_t LVD_SEL:4;
      uint64_t VMON_DDFT_SEL:3;
      uint64_t VMON_ADFT_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_VMON_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVMON1_SEL:3;
      uint64_t TVMON2_SEL:3;
      uint64_t BYPASS:1;
      uint64_t ACTIVE_EN:1;
      uint64_t ACTIVE_INRUSH_DIS:1;
      uint64_t LPCOMP_DIS:1;
      uint64_t BLEED_EN:1;
      uint64_t IPOR_EN:1;
      uint64_t POWER_UP_RAW_BYP:1;
      uint64_t POWER_UP_RAW_CTL:1;
      uint64_t DEEPSLEEP_EN:1;
      uint64_t RSVD_BYPASS:1;
      uint64_t NWELL_OPEN:1;
      uint64_t HIBERNATE_OPEN:1;
      uint64_t DEEPSLEEP_OPEN:1;
      uint64_t QUIET_OPEN:1;
      uint64_t LFCLK_OPEN:1;
      uint64_t reservedSpace0:1;
      uint64_t QUIET_EN:1;
      uint64_t BREF_EN:1;
      uint64_t BREF_OUTEN:1;
      uint64_t BREF_REFSW:1;
      uint64_t BREF_TESTMODE:1;
      uint64_t NWELL_DIS:1;
      uint64_t HVMON_DFT_OVR:1;
      uint64_t IMO_REFGEN_DIS:1;
      uint64_t POWER_UP_ACTIVE:1;
      uint64_t POWER_UP_HIBDPSLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_DFT_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDFT1_SEL:4;
      uint64_t DDFT2_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_DDFT_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY16:16;
      uint64_t HBOD_OFF_AWAKE:1;
      uint64_t BODS_OFF:1;
      uint64_t DFT_MODE:1;
      uint64_t IO_DISABLE_BYPASS:1;
      uint64_t VMON_PD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_DFT_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BOD_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOKEN:8;
      uint64_t UNLOCK:8;
      uint64_t POLARITY:1;
      uint64_t FREEZE:1;
      uint64_t reservedSpace0:13;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_STOP;

  uint8_t res0[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRECT_SEL:3;
      uint64_t DBL_SEL:3;
      uint64_t PLL_SEL:3;
      uint64_t DPLLIN_SEL:3;
      uint64_t DPLLREF_SEL:2;
      uint64_t WDT_LOCK:2;
      uint64_t HFCLK_SEL:2;
      uint64_t HALF_EN:1;
      uint64_t SYSCLK_DIV:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD_MODE:1;
      uint64_t TURBO:1;
      uint64_t SATBIAS:1;
      uint64_t reservedSpace0:28;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_ILO_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:22;
      uint64_t FLASHPUMP_SEL:1;
      uint64_t EN_FASTBIAS:1;
      uint64_t TEST_FASTBIAS:1;
      uint64_t PUMP_SEL:3;
      uint64_t TEST_USB_MODE:1;
      uint64_t EN_CLK36:1;
      uint64_t EN_CLK2X:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS_VALUE:5;
      uint64_t reservedSpace0:3;
      uint64_t SS_MAX:5;
      uint64_t reservedSpace1:15;
      uint64_t SS_RANGE:2;
      uint64_t SS_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_SPREAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_SEL1:4;
      uint64_t DFT_DIV1:2;
      uint64_t reservedSpace0:2;
      uint64_t DFT_SEL2:4;
      uint64_t DFT_DIV2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_DFT_SELECT;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_CTR0:16;
      uint64_t WDT_CTR1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_CTRLOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_CTR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_CTRHIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_MATCH0:16;
      uint64_t WDT_MATCH1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_MODE0:2;
      uint64_t WDT_CLEAR0:1;
      uint64_t WDT_CASCADE0_1:1;
      uint64_t reservedSpace0:4;
      uint64_t WDT_MODE1:2;
      uint64_t WDT_CLEAR1:1;
      uint64_t WDT_CASCADE1_2:1;
      uint64_t reservedSpace1:4;
      uint64_t WDT_MODE2:1;
      uint64_t reservedSpace2:7;
      uint64_t WDT_BITS2:5;
      uint64_t reservedSpace3:1;
      uint64_t LFCLK_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_ENABLE0:1;
      uint64_t WDT_ENABLED0:1;
      uint64_t WDT_INT0:1;
      uint64_t WDT_RESET0:1;
      uint64_t reservedSpace0:4;
      uint64_t WDT_ENABLE1:1;
      uint64_t WDT_ENABLED1:1;
      uint64_t WDT_INT1:1;
      uint64_t WDT_RESET1:1;
      uint64_t reservedSpace1:4;
      uint64_t WDT_ENABLE2:1;
      uint64_t WDT_ENABLED2:1;
      uint64_t WDT_INT2:1;
      uint64_t WDT_RESET2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_CONTROL;

