iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res2[236];

  uint32_t RES_CAUSE;
  uint8_t res3[64508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_BIAS_TRIM:3;
      uint64_t BOD_TURBO_THRESH:1;
      uint64_t BOD_TRIM_TRIP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_PWRSYS_TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFCLK_TRIM_LOAD:2;
      uint64_t LFCLK_TRIM_VOLTAGE:2;
      uint64_t DPSLP_TRIM_LOAD:2;
      uint64_t DPSLP_TRIM_LEAKAGE:1;
      uint64_t DPSLP_TRIM_VOLTAGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_PWRSYS_TRIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWELL_TRIM:3;
      uint64_t QUIET_TRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_PWRSYS_TRIM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TRIM_NWELL:2;
      uint64_t HIB_TRIM_LEAKAGE:1;
      uint64_t HIB_TRIM_VOLTAGE:1;
      uint64_t HIB_TRIM_REFERENCE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_PWRSYS_TRIM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INL_TRIM_MAIN:3;
      uint64_t INL_CROSS_MAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCTAT_SLOPE:4;
      uint64_t VCTAT_VOLTAGE:2;
      uint64_t VCTAT_ENABLE:1;
      uint64_t VCTAT_VOLTAGE_MSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INL_TRIM_IMO:3;
      uint64_t INL_CROSS_IMO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABS_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMPCO_TRIM_IMO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:4;
      uint64_t COARSE_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_ILO_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_CLK36:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:5;
      uint64_t FSOFFSET:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_RSVD_TRIM;

};

#define SRSS (*(volatile struct SRSS_tag *) 0x400b0000)

struct SPCIF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH:16;
      uint64_t SFLASH_bitfield:4;
      uint64_t NUM_FLASH:2;
      uint64_t FLASH_ROW:2;
      uint64_t NVL:7;
      uint64_t DE_CPD_LP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GEOMETRY;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVL_WR_DATA;

};

#define SPCIF (*(volatile struct SPCIF_tag *) 0x400e0000)

struct UDB_UDB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_MODE_CFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_CFG;

};

#define UDB_UDB (*(volatile struct UDB_UDB_tag *) 0x400f8000)

struct UDB_UDB_W8_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t A0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A0_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A0_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A0_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A0_03;

  uint8_t res0[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A1_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A1_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A1_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t A1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A1_03;

  uint8_t res1[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D0_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D0_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D0_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D0_03;

  uint8_t res2[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D1_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D1_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D1_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D1_03;

  uint8_t res3[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F0_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F0_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F0_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F0_03;

  uint8_t res4[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F1_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F1_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F1_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F1_03;

