iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res5[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ST_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ST_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ST_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ST_03;

  uint8_t res6[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CTL_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CTL_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CTL_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CTL_03;

  uint8_t res7[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MSK_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MSK_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MSK_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MSK_03;

  uint8_t res8[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FIFO0_CLR:1;
      uint64_t FIFO1_CLR:1;
      uint64_t FIFO0_LVL:1;
      uint64_t FIFO1_LVL:1;
      uint64_t INT_EN:1;
      uint64_t CNT_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ACTL_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FIFO0_CLR:1;
      uint64_t FIFO1_CLR:1;
      uint64_t FIFO0_LVL:1;
      uint64_t FIFO1_LVL:1;
      uint64_t INT_EN:1;
      uint64_t CNT_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ACTL_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FIFO0_CLR:1;
      uint64_t FIFO1_CLR:1;
      uint64_t FIFO0_LVL:1;
      uint64_t FIFO1_LVL:1;
      uint64_t INT_EN:1;
      uint64_t CNT_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ACTL_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FIFO0_CLR:1;
      uint64_t FIFO1_CLR:1;
      uint64_t FIFO0_LVL:1;
      uint64_t FIFO1_LVL:1;
      uint64_t INT_EN:1;
      uint64_t CNT_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ACTL_03;

  uint8_t res9[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_MC:4;
      uint64_t PLD1_MC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MC_00;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_MC:4;
      uint64_t PLD1_MC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MC_01;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_MC:4;
      uint64_t PLD1_MC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MC_02;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_MC:4;
      uint64_t PLD1_MC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MC_03;

};

#define UDB_UDB_W8 (*(volatile struct UDB_UDB_W8_tag *) 0x400f0000)

struct UDB_UDB_W16_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t A0_LS:8;
      uint64_t A0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) A0_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t A0_LS:8;
      uint64_t A0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) A0_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t A0_LS:8;
      uint64_t A0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) A0_02;

  uint8_t res0[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t A1_LS:8;
      uint64_t A1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) A1_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t A1_LS:8;
      uint64_t A1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) A1_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t A1_LS:8;
      uint64_t A1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) A1_02;

  uint8_t res1[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D0_LS:8;
      uint64_t D0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) D0_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D0_LS:8;
      uint64_t D0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) D0_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D0_LS:8;
      uint64_t D0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) D0_02;

  uint8_t res2[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D1_LS:8;
      uint64_t D1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) D1_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D1_LS:8;
      uint64_t D1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) D1_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D1_LS:8;
      uint64_t D1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) D1_02;

  uint8_t res3[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F0_LS:8;
      uint64_t F0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) F0_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F0_LS:8;
      uint64_t F0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) F0_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F0_LS:8;
      uint64_t F0_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) F0_02;

  uint8_t res4[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F1_LS:8;
      uint64_t F1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) F1_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F1_LS:8;
      uint64_t F1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) F1_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F1_LS:8;
      uint64_t F1_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) F1_02;

  uint8_t res5[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ST_LS:8;
      uint64_t ST_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ST_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ST_LS:8;
      uint64_t ST_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ST_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ST_LS:8;
      uint64_t ST_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ST_02;

