iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res6[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTL_LS:8;
      uint64_t CTL_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTL_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTL_LS:8;
      uint64_t CTL_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTL_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTL_LS:8;
      uint64_t CTL_MS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTL_02;

  uint8_t res7[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_LS:7;
      uint64_t reservedSpace0:1;
      uint64_t MSK_MS:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSK_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_LS:7;
      uint64_t reservedSpace0:1;
      uint64_t MSK_MS:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSK_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_LS:7;
      uint64_t reservedSpace0:1;
      uint64_t MSK_MS:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSK_02;

  uint8_t res8[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIFO0_CLR_LS:1;
      uint64_t FIFO1_CLR_LS:1;
      uint64_t FIFO0_LVL_LS:1;
      uint64_t FIFO1_LVL_LS:1;
      uint64_t INT_EN_LS:1;
      uint64_t CNT_START_LS:1;
      uint64_t reservedSpace0:2;
      uint64_t FIFO0_CLR_MS:1;
      uint64_t FIFO1_CLR_MS:1;
      uint64_t FIFO0_LVL_MS:1;
      uint64_t FIFO1_LVL_MS:1;
      uint64_t INT_EN_MS:1;
      uint64_t CNT_START_MS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ACTL_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIFO0_CLR_LS:1;
      uint64_t FIFO1_CLR_LS:1;
      uint64_t FIFO0_LVL_LS:1;
      uint64_t FIFO1_LVL_LS:1;
      uint64_t INT_EN_LS:1;
      uint64_t CNT_START_LS:1;
      uint64_t reservedSpace0:2;
      uint64_t FIFO0_CLR_MS:1;
      uint64_t FIFO1_CLR_MS:1;
      uint64_t FIFO0_LVL_MS:1;
      uint64_t FIFO1_LVL_MS:1;
      uint64_t INT_EN_MS:1;
      uint64_t CNT_START_MS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ACTL_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIFO0_CLR_LS:1;
      uint64_t FIFO1_CLR_LS:1;
      uint64_t FIFO0_LVL_LS:1;
      uint64_t FIFO1_LVL_LS:1;
      uint64_t INT_EN_LS:1;
      uint64_t CNT_START_LS:1;
      uint64_t reservedSpace0:2;
      uint64_t FIFO0_CLR_MS:1;
      uint64_t FIFO1_CLR_MS:1;
      uint64_t FIFO0_LVL_MS:1;
      uint64_t FIFO1_LVL_MS:1;
      uint64_t INT_EN_MS:1;
      uint64_t CNT_START_MS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ACTL_02;

  uint8_t res9[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC_LS:4;
      uint64_t PLD1_MC_LS:4;
      uint64_t PLD0_MC_MS:4;
      uint64_t PLD1_MC_MS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MC_00;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC_LS:4;
      uint64_t PLD1_MC_LS:4;
      uint64_t PLD0_MC_MS:4;
      uint64_t PLD1_MC_MS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MC_01;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC_LS:4;
      uint64_t PLD1_MC_LS:4;
      uint64_t PLD0_MC_MS:4;
      uint64_t PLD1_MC_MS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MC_02;

};

#define UDB_UDB_W16 (*(volatile struct UDB_UDB_W16_tag *) 0x400f1000)

struct UDB_UDB_W32_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A0_0:8;
      uint64_t A0_1:8;
      uint64_t A0_2:8;
      uint64_t A0_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A0_00;

  uint8_t res0[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A1_0:8;
      uint64_t A1_1:8;
      uint64_t A1_2:8;
      uint64_t A1_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A1_00;

  uint8_t res1[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0_0:8;
      uint64_t D0_1:8;
      uint64_t D0_2:8;
      uint64_t D0_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D0_00;

  uint8_t res2[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D1_0:8;
      uint64_t D1_1:8;
      uint64_t D1_2:8;
      uint64_t D1_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D1_00;

  uint8_t res3[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0_0:8;
      uint64_t F0_1:8;
      uint64_t F0_2:8;
      uint64_t F0_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0_00;

  uint8_t res4[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1_0:8;
      uint64_t F1_1:8;
      uint64_t F1_2:8;
      uint64_t F1_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1_00;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_0:8;
      uint64_t ST_1:8;
      uint64_t ST_2:8;
      uint64_t ST_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST_00;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTL_0:8;
      uint64_t CTL_1:8;
      uint64_t CTL_2:8;
      uint64_t CTL_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL_00;

  uint8_t res7[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSK_0:7;
      uint64_t reservedSpace0:1;
      uint64_t MSK_1:7;
      uint64_t reservedSpace1:1;
      uint64_t MSK_2:7;
      uint64_t reservedSpace2:1;
      uint64_t MSK_3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSK_00;

  uint8_t res8[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFO0_CLR_0:1;
      uint64_t FIFO1_CLR_0:1;
      uint64_t FIFO0_LVL_0:1;
      uint64_t FIFO1_LVL_0:1;
      uint64_t INT_EN_0:1;
      uint64_t CNT_START_0:1;
      uint64_t reservedSpace0:2;
      uint64_t FIFO0_CLR_1:1;
      uint64_t FIFO1_CLR_1:1;
      uint64_t FIFO0_LVL_1:1;
      uint64_t FIFO1_LVL_1:1;
      uint64_t INT_EN_1:1;
      uint64_t CNT_START_1:1;
      uint64_t reservedSpace1:2;
      uint64_t FIFO0_CLR_2:1;
      uint64_t FIFO1_CLR_2:1;
      uint64_t FIFO0_LVL_2:1;
      uint64_t FIFO1_LVL_2:1;
      uint64_t INT_EN_2:1;
      uint64_t CNT_START_2:1;
      uint64_t reservedSpace2:2;
      uint64_t FIFO0_CLR_3:1;
      uint64_t FIFO1_CLR_3:1;
      uint64_t FIFO0_LVL_3:1;
      uint64_t FIFO1_LVL_3:1;
      uint64_t INT_EN_3:1;
      uint64_t CNT_START_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACTL_00;

