iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_CK_SEL:4;
      uint64_t PLD1_CK_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DP_CK_SEL:4;
      uint64_t SC_CK_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EN_RES_CNTCTL:1;
      uint64_t GUDB_WR:1;
      uint64_t reservedSpace1:1;
      uint64_t DP_RES_POL:1;
      uint64_t SC_RES_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALT_RES:1;
      uint64_t EXT_SYNC:1;
      uint64_t EN_RES_STAT:1;
      uint64_t EN_RES_DP:1;
      uint64_t EXT_CK_SEL:2;
      uint64_t PLD0_RES_POL:1;
      uint64_t PLD1_RES_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG7;

};

#define UDB_UDB_P0_U0 (*(volatile struct UDB_UDB_P0_U0_tag *) 0x400f3000)

struct UDB_UDB_P0_U1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_CEN:1;
      uint64_t PLD0_MC0_DFF_C:1;
      uint64_t PLD0_MC1_CEN:1;
      uint64_t PLD0_MC1_DFF_C:1;
      uint64_t PLD0_MC2_CEN:1;
      uint64_t PLD0_MC2_DFF_C:1;
      uint64_t PLD0_MC3_CEN:1;
      uint64_t PLD0_MC3_DFF_C:1;
      uint64_t PLD1_MC0_CEN:1;
      uint64_t PLD1_MC0_DFF_C:1;
      uint64_t PLD1_MC1_CEN:1;
      uint64_t PLD1_MC1_DFF_C:1;
      uint64_t PLD1_MC2_CEN:1;
      uint64_t PLD1_MC2_DFF_C:1;
      uint64_t PLD1_MC3_CEN:1;
      uint64_t PLD1_MC3_DFF_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_CEN_CONST;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_XORFB:2;
      uint64_t PLD0_MC1_XORFB:2;
      uint64_t PLD0_MC2_XORFB:2;
      uint64_t PLD0_MC3_XORFB:2;
      uint64_t PLD1_MC0_XORFB:2;
      uint64_t PLD1_MC1_XORFB:2;
      uint64_t PLD1_MC2_XORFB:2;
      uint64_t PLD1_MC3_XORFB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_XORFB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_SET_SEL:1;
      uint64_t PLD0_MC0_RESET_SEL:1;
      uint64_t PLD0_MC1_SET_SEL:1;
      uint64_t PLD0_MC1_RESET_SEL:1;
      uint64_t PLD0_MC2_SET_SEL:1;
      uint64_t PLD0_MC2_RESET_SEL:1;
      uint64_t PLD0_MC3_SET_SEL:1;
      uint64_t PLD0_MC3_RESET_SEL:1;
      uint64_t PLD1_MC0_SET_SEL:1;
      uint64_t PLD1_MC0_RESET_SEL:1;
      uint64_t PLD1_MC1_SET_SEL:1;
      uint64_t PLD1_MC1_RESET_SEL:1;
      uint64_t PLD1_MC2_SET_SEL:1;
      uint64_t PLD1_MC2_RESET_SEL:1;
      uint64_t PLD1_MC3_SET_SEL:1;
      uint64_t PLD1_MC3_RESET_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_SET_RESET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_BYPASS:1;
      uint64_t NC1:1;
      uint64_t PLD0_MC1_BYPASS:1;
      uint64_t NC3:1;
      uint64_t PLD0_MC2_BYPASS:1;
      uint64_t NC5:1;
      uint64_t PLD0_MC3_BYPASS:1;
      uint64_t NC7:1;
      uint64_t PLD1_MC0_BYPASS:1;
      uint64_t NC9:1;
      uint64_t PLD1_MC1_BYPASS:1;
      uint64_t NC11:1;
      uint64_t PLD1_MC2_BYPASS:1;
      uint64_t NC13:1;
      uint64_t PLD1_MC3_BYPASS:1;
      uint64_t NC15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_BYPASS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAD0:3;
      uint64_t reservedSpace0:1;
      uint64_t RAD1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAD2:3;
      uint64_t DP_RTE_BYPASS0:1;
      uint64_t DP_RTE_BYPASS1:1;
      uint64_t DP_RTE_BYPASS2:1;
      uint64_t DP_RTE_BYPASS3:1;
      uint64_t DP_RTE_BYPASS4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_LD:3;
      uint64_t DP_RTE_BYPASS5:1;
      uint64_t F1_LD:3;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0_LD:3;
      uint64_t reservedSpace0:1;
      uint64_t D1_LD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SI_MUX:3;
      uint64_t reservedSpace0:1;
      uint64_t CI_MUX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT0:4;
      uint64_t OUT1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT2:4;
      uint64_t OUT3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG6;

