iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R15;

  uint8_t res0[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD0IN0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD0IN1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD0IN2;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD1IN0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD1IN1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD1IN2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DPIN0;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PI_TOP2:2;
      uint64_t PI_BOT2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DPIN1;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCIN;

  uint8_t res4[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCIOIN;

  uint8_t res5[5];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCIN;

  uint8_t res6[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS7;

};

#define UDB_UDB_P0_ROUTE (*(volatile struct UDB_UDB_P0_ROUTE_tag *) 0x400f3100)

struct UDB_UDB_P1_U0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_CEN:1;
      uint64_t PLD0_MC0_DFF_C:1;
      uint64_t PLD0_MC1_CEN:1;
      uint64_t PLD0_MC1_DFF_C:1;
      uint64_t PLD0_MC2_CEN:1;
      uint64_t PLD0_MC2_DFF_C:1;
      uint64_t PLD0_MC3_CEN:1;
      uint64_t PLD0_MC3_DFF_C:1;
      uint64_t PLD1_MC0_CEN:1;
      uint64_t PLD1_MC0_DFF_C:1;
      uint64_t PLD1_MC1_CEN:1;
      uint64_t PLD1_MC1_DFF_C:1;
      uint64_t PLD1_MC2_CEN:1;
      uint64_t PLD1_MC2_DFF_C:1;
      uint64_t PLD1_MC3_CEN:1;
      uint64_t PLD1_MC3_DFF_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_CEN_CONST;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_XORFB:2;
      uint64_t PLD0_MC1_XORFB:2;
      uint64_t PLD0_MC2_XORFB:2;
      uint64_t PLD0_MC3_XORFB:2;
      uint64_t PLD1_MC0_XORFB:2;
      uint64_t PLD1_MC1_XORFB:2;
      uint64_t PLD1_MC2_XORFB:2;
      uint64_t PLD1_MC3_XORFB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_XORFB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_SET_SEL:1;
      uint64_t PLD0_MC0_RESET_SEL:1;
      uint64_t PLD0_MC1_SET_SEL:1;
      uint64_t PLD0_MC1_RESET_SEL:1;
      uint64_t PLD0_MC2_SET_SEL:1;
      uint64_t PLD0_MC2_RESET_SEL:1;
      uint64_t PLD0_MC3_SET_SEL:1;
      uint64_t PLD0_MC3_RESET_SEL:1;
      uint64_t PLD1_MC0_SET_SEL:1;
      uint64_t PLD1_MC0_RESET_SEL:1;
      uint64_t PLD1_MC1_SET_SEL:1;
      uint64_t PLD1_MC1_RESET_SEL:1;
      uint64_t PLD1_MC2_SET_SEL:1;
      uint64_t PLD1_MC2_RESET_SEL:1;
      uint64_t PLD1_MC3_SET_SEL:1;
      uint64_t PLD1_MC3_RESET_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_SET_RESET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_BYPASS:1;
      uint64_t NC1:1;
      uint64_t PLD0_MC1_BYPASS:1;
      uint64_t NC3:1;
      uint64_t PLD0_MC2_BYPASS:1;
      uint64_t NC5:1;
      uint64_t PLD0_MC3_BYPASS:1;
      uint64_t NC7:1;
      uint64_t PLD1_MC0_BYPASS:1;
      uint64_t NC9:1;
      uint64_t PLD1_MC1_BYPASS:1;
      uint64_t NC11:1;
      uint64_t PLD1_MC2_BYPASS:1;
      uint64_t NC13:1;
      uint64_t PLD1_MC3_BYPASS:1;
      uint64_t NC15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_BYPASS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAD0:3;
      uint64_t reservedSpace0:1;
      uint64_t RAD1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG0;

