iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAD2:3;
      uint64_t DP_RTE_BYPASS0:1;
      uint64_t DP_RTE_BYPASS1:1;
      uint64_t DP_RTE_BYPASS2:1;
      uint64_t DP_RTE_BYPASS3:1;
      uint64_t DP_RTE_BYPASS4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_LD:3;
      uint64_t DP_RTE_BYPASS5:1;
      uint64_t F1_LD:3;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0_LD:3;
      uint64_t reservedSpace0:1;
      uint64_t D1_LD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SI_MUX:3;
      uint64_t reservedSpace0:1;
      uint64_t CI_MUX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT0:4;
      uint64_t OUT1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT2:4;
      uint64_t OUT3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT4:4;
      uint64_t OUT5:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT_SYNC:6;
      uint64_t NC6:1;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CMASK0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CMASK0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SI_SELA:2;
      uint64_t SI_SELB:2;
      uint64_t DEF_SI:1;
      uint64_t AMASK_EN:1;
      uint64_t CMASK0_EN:1;
      uint64_t CMASK1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CI_SELA:2;
      uint64_t CI_SELB:2;
      uint64_t CMP_SELA:2;
      uint64_t CMP_SELB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHAIN0:1;
      uint64_t CHAIN1:1;
      uint64_t CHAIN_FB:1;
      uint64_t CHAIN_CMSB:1;
      uint64_t MSB_SEL:3;
      uint64_t MSB_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_INSEL:2;
      uint64_t F1_INSEL:2;
      uint64_t MSB_SI:1;
      uint64_t PI_DYN:1;
      uint64_t SHIFT_SEL:1;
      uint64_t PI_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WRK16_CONCAT:1;
      uint64_t EXT_CRCPRS:1;
      uint64_t FIFO_ASYNC:1;
      uint64_t FIFO_EDGE:1;
      uint64_t FIFO_CAP:1;
      uint64_t FIFO_FAST:1;
      uint64_t F0_CK_INV:1;
      uint64_t F1_CK_INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_DYN:1;
      uint64_t F1_DYN:1;
      uint64_t NC2:1;
      uint64_t NC3:1;
      uint64_t FIFO_ADD_SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL_MD0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL_MD1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STAT_MD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NC0:1;
      uint64_t NC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SC_OUT_CTL:2;
      uint64_t SC_INT_MD:1;
      uint64_t SC_SYNC_MD:1;
      uint64_t SC_EXT_RES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CNT_LD_SEL:2;
      uint64_t CNT_EN_SEL:2;
      uint64_t ROUTE_LD:1;
      uint64_t ROUTE_EN:1;
      uint64_t ALT_CNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_CK_SEL:4;
      uint64_t PLD1_CK_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DP_CK_SEL:4;
      uint64_t SC_CK_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EN_RES_CNTCTL:1;
      uint64_t GUDB_WR:1;
      uint64_t reservedSpace1:1;
      uint64_t DP_RES_POL:1;
      uint64_t SC_RES_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALT_RES:1;
      uint64_t EXT_SYNC:1;
      uint64_t EN_RES_STAT:1;
      uint64_t EN_RES_DP:1;
      uint64_t EXT_CK_SEL:2;
      uint64_t PLD0_RES_POL:1;
      uint64_t PLD1_RES_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG7;

