iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define UDB_UDB_P1_U0 (*(volatile struct UDB_UDB_P1_U0_tag *) 0x400f3200)

struct UDB_UDB_P1_U1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLD0_ITxC_0:1;
      uint64_t PLD0_ITxC_1:1;
      uint64_t PLD0_ITxC_2:1;
      uint64_t PLD0_ITxC_3:1;
      uint64_t PLD0_ITxC_4:1;
      uint64_t PLD0_ITxC_5:1;
      uint64_t PLD0_ITxC_6:1;
      uint64_t PLD0_ITxC_7:1;
      uint64_t PLD1_ITxC_0:1;
      uint64_t PLD1_ITxC_1:1;
      uint64_t PLD1_ITxC_2:1;
      uint64_t PLD1_ITxC_3:1;
      uint64_t PLD1_ITxC_4:1;
      uint64_t PLD1_ITxC_5:1;
      uint64_t PLD1_ITxC_6:1;
      uint64_t PLD1_ITxC_7:1;
      uint64_t PLD0_ITxT_0:1;
      uint64_t PLD0_ITxT_1:1;
      uint64_t PLD0_ITxT_2:1;
      uint64_t PLD0_ITxT_3:1;
      uint64_t PLD0_ITxT_4:1;
      uint64_t PLD0_ITxT_5:1;
      uint64_t PLD0_ITxT_6:1;
      uint64_t PLD0_ITxT_7:1;
      uint64_t PLD1_ITxT_0:1;
      uint64_t PLD1_ITxT_1:1;
      uint64_t PLD1_ITxT_2:1;
      uint64_t PLD1_ITxT_3:1;
      uint64_t PLD1_ITxT_4:1;
      uint64_t PLD1_ITxT_5:1;
      uint64_t PLD1_ITxT_6:1;
      uint64_t PLD1_ITxT_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLD_IT11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_ORT_PTx_0:1;
      uint64_t PLD0_ORT_PTx_1:1;
      uint64_t PLD0_ORT_PTx_2:1;
      uint64_t PLD0_ORT_PTx_3:1;
      uint64_t PLD0_ORT_PTx_4:1;
      uint64_t PLD0_ORT_PTx_5:1;
      uint64_t PLD0_ORT_PTx_6:1;
      uint64_t PLD0_ORT_PTx_7:1;
      uint64_t PLD1_ORT_PTx_0:1;
      uint64_t PLD1_ORT_PTx_1:1;
      uint64_t PLD1_ORT_PTx_2:1;
      uint64_t PLD1_ORT_PTx_3:1;
      uint64_t PLD1_ORT_PTx_4:1;
      uint64_t PLD1_ORT_PTx_5:1;
      uint64_t PLD1_ORT_PTx_6:1;
      uint64_t PLD1_ORT_PTx_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_ORT3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_CEN:1;
      uint64_t PLD0_MC0_DFF_C:1;
      uint64_t PLD0_MC1_CEN:1;
      uint64_t PLD0_MC1_DFF_C:1;
      uint64_t PLD0_MC2_CEN:1;
      uint64_t PLD0_MC2_DFF_C:1;
      uint64_t PLD0_MC3_CEN:1;
      uint64_t PLD0_MC3_DFF_C:1;
      uint64_t PLD1_MC0_CEN:1;
      uint64_t PLD1_MC0_DFF_C:1;
      uint64_t PLD1_MC1_CEN:1;
      uint64_t PLD1_MC1_DFF_C:1;
      uint64_t PLD1_MC2_CEN:1;
      uint64_t PLD1_MC2_DFF_C:1;
      uint64_t PLD1_MC3_CEN:1;
      uint64_t PLD1_MC3_DFF_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_CEN_CONST;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_XORFB:2;
      uint64_t PLD0_MC1_XORFB:2;
      uint64_t PLD0_MC2_XORFB:2;
      uint64_t PLD0_MC3_XORFB:2;
      uint64_t PLD1_MC0_XORFB:2;
      uint64_t PLD1_MC1_XORFB:2;
      uint64_t PLD1_MC2_XORFB:2;
      uint64_t PLD1_MC3_XORFB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_XORFB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_SET_SEL:1;
      uint64_t PLD0_MC0_RESET_SEL:1;
      uint64_t PLD0_MC1_SET_SEL:1;
      uint64_t PLD0_MC1_RESET_SEL:1;
      uint64_t PLD0_MC2_SET_SEL:1;
      uint64_t PLD0_MC2_RESET_SEL:1;
      uint64_t PLD0_MC3_SET_SEL:1;
      uint64_t PLD0_MC3_RESET_SEL:1;
      uint64_t PLD1_MC0_SET_SEL:1;
      uint64_t PLD1_MC0_RESET_SEL:1;
      uint64_t PLD1_MC1_SET_SEL:1;
      uint64_t PLD1_MC1_RESET_SEL:1;
      uint64_t PLD1_MC2_SET_SEL:1;
      uint64_t PLD1_MC2_RESET_SEL:1;
      uint64_t PLD1_MC3_SET_SEL:1;
      uint64_t PLD1_MC3_RESET_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_SET_RESET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLD0_MC0_BYPASS:1;
      uint64_t NC1:1;
      uint64_t PLD0_MC1_BYPASS:1;
      uint64_t NC3:1;
      uint64_t PLD0_MC2_BYPASS:1;
      uint64_t NC5:1;
      uint64_t PLD0_MC3_BYPASS:1;
      uint64_t NC7:1;
      uint64_t PLD1_MC0_BYPASS:1;
      uint64_t NC9:1;
      uint64_t PLD1_MC1_BYPASS:1;
      uint64_t NC11:1;
      uint64_t PLD1_MC2_BYPASS:1;
      uint64_t NC13:1;
      uint64_t PLD1_MC3_BYPASS:1;
      uint64_t NC15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLD_MC_CFG_BYPASS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAD0:3;
      uint64_t reservedSpace0:1;
      uint64_t RAD1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAD2:3;
      uint64_t DP_RTE_BYPASS0:1;
      uint64_t DP_RTE_BYPASS1:1;
      uint64_t DP_RTE_BYPASS2:1;
      uint64_t DP_RTE_BYPASS3:1;
      uint64_t DP_RTE_BYPASS4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_LD:3;
      uint64_t DP_RTE_BYPASS5:1;
      uint64_t F1_LD:3;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D0_LD:3;
      uint64_t reservedSpace0:1;
      uint64_t D1_LD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SI_MUX:3;
      uint64_t reservedSpace0:1;
      uint64_t CI_MUX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT0:4;
      uint64_t OUT1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT2:4;
      uint64_t OUT3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT4:4;
      uint64_t OUT5:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT_SYNC:6;
      uint64_t NC6:1;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CMASK0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CMASK0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SI_SELA:2;
      uint64_t SI_SELB:2;
      uint64_t DEF_SI:1;
      uint64_t AMASK_EN:1;
      uint64_t CMASK0_EN:1;
      uint64_t CMASK1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CI_SELA:2;
      uint64_t CI_SELB:2;
      uint64_t CMP_SELA:2;
      uint64_t CMP_SELB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHAIN0:1;
      uint64_t CHAIN1:1;
      uint64_t CHAIN_FB:1;
      uint64_t CHAIN_CMSB:1;
      uint64_t MSB_SEL:3;
      uint64_t MSB_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_INSEL:2;
      uint64_t F1_INSEL:2;
      uint64_t MSB_SI:1;
      uint64_t PI_DYN:1;
      uint64_t SHIFT_SEL:1;
      uint64_t PI_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WRK16_CONCAT:1;
      uint64_t EXT_CRCPRS:1;
      uint64_t FIFO_ASYNC:1;
      uint64_t FIFO_EDGE:1;
      uint64_t FIFO_CAP:1;
      uint64_t FIFO_FAST:1;
      uint64_t F0_CK_INV:1;
      uint64_t F1_CK_INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t F0_DYN:1;
      uint64_t F1_DYN:1;
      uint64_t NC2:1;
      uint64_t NC3:1;
      uint64_t FIFO_ADD_SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL_MD0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTL_MD1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STAT_MD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NC0:1;
      uint64_t NC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SC_OUT_CTL:2;
      uint64_t SC_INT_MD:1;
      uint64_t SC_SYNC_MD:1;
      uint64_t SC_EXT_RES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CNT_LD_SEL:2;
      uint64_t CNT_EN_SEL:2;
      uint64_t ROUTE_LD:1;
      uint64_t ROUTE_EN:1;
      uint64_t ALT_CNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG26;

