iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RC_EN_SEL:2;
      uint64_t RC_EN_MODE:2;
      uint64_t RC_EN_INV:1;
      uint64_t RC_INV:1;
      uint64_t RC_RES_SEL0_OR_FRES:1;
      uint64_t RC_RES_SEL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLD0_CK_SEL:4;
      uint64_t PLD1_CK_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DP_CK_SEL:4;
      uint64_t SC_CK_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EN_RES_CNTCTL:1;
      uint64_t GUDB_WR:1;
      uint64_t reservedSpace1:1;
      uint64_t DP_RES_POL:1;
      uint64_t SC_RES_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALT_RES:1;
      uint64_t EXT_SYNC:1;
      uint64_t EN_RES_STAT:1;
      uint64_t EN_RES_DP:1;
      uint64_t EXT_CK_SEL:2;
      uint64_t PLD0_RES_POL:1;
      uint64_t PLD1_RES_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_SEL:1;
      uint64_t SI_SEL:1;
      uint64_t CI_SEL:1;
      uint64_t CFB_EN:1;
      uint64_t A1_WR_SRC:2;
      uint64_t A0_WR_SRC:2;
      uint64_t SHIFT:2;
      uint64_t SRC_B:2;
      uint64_t SRC_A:1;
      uint64_t FUNC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCFG7;

};

#define UDB_UDB_P1_U1 (*(volatile struct UDB_UDB_P1_U1_tag *) 0x400f3280)

struct UDB_UDB_P1_ROUTE_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L9;

