iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_R15;

  uint8_t res0[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIINP0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIINP1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIINP2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIINP3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIINP4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIINP5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTP0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTP1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTP2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTP3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTT0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTT2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTT3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTT4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PI_TOP:4;
      uint64_t PI_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DSIOUTT5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VS_TOP:4;
      uint64_t VS_BOT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VS7;

