iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define UDB_UDB_DSI2 (*(volatile struct UDB_UDB_DSI2_tag *) 0x400f4200)

struct UDB_UDB_DSI3_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HC_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HC127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HV_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HV_L15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS_BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HS23;

