iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define UDB_UDB_PA1 (*(volatile struct UDB_UDB_PA1_tag *) 0x400f5010)

struct UDB_UDB_PA2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLKIN_EN_SEL:2;
      uint64_t CLKIN_EN_MODE:2;
      uint64_t CLKIN_EN_INV:1;
      uint64_t CLKIN_INV:1;
      uint64_t NC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLKOUT_EN_SEL:2;
      uint64_t CLKOUT_EN_MODE:2;
      uint64_t CLKOUT_EN_INV:1;
      uint64_t CLKOUT_INV:1;
      uint64_t NC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLKIN_SEL:4;
      uint64_t CLKOUT_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t NC0:1;
      uint64_t reservedSpace1:3;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t NC7654:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PIN_SEL:1;
      uint64_t reservedSpace0:2;
      uint64_t NC7654:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IN_SYNC0:2;
      uint64_t IN_SYNC1:2;
      uint64_t IN_SYNC2:2;
      uint64_t IN_SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IN_SYNC4:2;
      uint64_t IN_SYNC5:2;
      uint64_t IN_SYNC6:2;
      uint64_t IN_SYNC7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT_SYNC0:2;
      uint64_t OUT_SYNC1:2;
      uint64_t OUT_SYNC2:2;
      uint64_t OUT_SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT_SYNC4:2;
      uint64_t OUT_SYNC5:2;
      uint64_t OUT_SYNC6:2;
      uint64_t OUT_SYNC7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA_SEL0:2;
      uint64_t DATA_SEL1:2;
      uint64_t DATA_SEL2:2;
      uint64_t DATA_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA_SEL4:2;
      uint64_t DATA_SEL5:2;
      uint64_t DATA_SEL6:2;
      uint64_t DATA_SEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OE_SEL0:2;
      uint64_t OE_SEL1:2;
      uint64_t OE_SEL2:2;
      uint64_t OE_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OE_SEL4:2;
      uint64_t OE_SEL5:2;
      uint64_t OE_SEL6:2;
      uint64_t OE_SEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OE_SYNC0:2;
      uint64_t OE_SYNC1:2;
      uint64_t OE_SYNC2:2;
      uint64_t OE_SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG14;

};

#define UDB_UDB_PA2 (*(volatile struct UDB_UDB_PA2_tag *) 0x400f5020)

struct UDB_UDB_PA3_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLKIN_EN_SEL:2;
      uint64_t CLKIN_EN_MODE:2;
      uint64_t CLKIN_EN_INV:1;
      uint64_t CLKIN_INV:1;
      uint64_t NC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLKOUT_EN_SEL:2;
      uint64_t CLKOUT_EN_MODE:2;
      uint64_t CLKOUT_EN_INV:1;
      uint64_t CLKOUT_INV:1;
      uint64_t NC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLKIN_SEL:4;
      uint64_t CLKOUT_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t NC0:1;
      uint64_t reservedSpace1:3;
      uint64_t NC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t NC7654:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PIN_SEL:1;
      uint64_t reservedSpace0:2;
      uint64_t NC7654:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IN_SYNC0:2;
      uint64_t IN_SYNC1:2;
      uint64_t IN_SYNC2:2;
      uint64_t IN_SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IN_SYNC4:2;
      uint64_t IN_SYNC5:2;
      uint64_t IN_SYNC6:2;
      uint64_t IN_SYNC7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT_SYNC0:2;
      uint64_t OUT_SYNC1:2;
      uint64_t OUT_SYNC2:2;
      uint64_t OUT_SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OUT_SYNC4:2;
      uint64_t OUT_SYNC5:2;
      uint64_t OUT_SYNC6:2;
      uint64_t OUT_SYNC7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA_SEL0:2;
      uint64_t DATA_SEL1:2;
      uint64_t DATA_SEL2:2;
      uint64_t DATA_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA_SEL4:2;
      uint64_t DATA_SEL5:2;
      uint64_t DATA_SEL6:2;
      uint64_t DATA_SEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OE_SEL0:2;
      uint64_t OE_SEL1:2;
      uint64_t OE_SEL2:2;
      uint64_t OE_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OE_SEL4:2;
      uint64_t OE_SEL5:2;
      uint64_t OE_SEL6:2;
      uint64_t OE_SEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OE_SYNC0:2;
      uint64_t OE_SYNC1:2;
      uint64_t OE_SYNC2:2;
      uint64_t OE_SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG14;

