iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
};

#define UDB_UDB_PA3 (*(volatile struct UDB_UDB_PA3_tag *) 0x400f5030)

struct UDB_UDB_BCTL0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DRV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DRV;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DCEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDCLK_EN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MBCLK_EN;

  uint8_t res0[5];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLK_SEL0:2;
      uint64_t CLK_SEL1:2;
      uint64_t CLK_SEL2:2;
      uint64_t CLK_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BOTSEL_L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLK_SEL4:2;
      uint64_t CLK_SEL5:2;
      uint64_t CLK_SEL6:2;
      uint64_t CLK_SEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BOTSEL_U;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLK_SEL0:2;
      uint64_t CLK_SEL1:2;
      uint64_t CLK_SEL2:2;
      uint64_t CLK_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TOPSEL_L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLK_SEL4:2;
      uint64_t CLK_SEL5:2;
      uint64_t CLK_SEL6:2;
      uint64_t CLK_SEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TOPSEL_U;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCEN_Q:8;
      uint64_t BCEN_Q:1;
      uint64_t GCH_WR_LO:1;
      uint64_t GCH_WR_HI:1;
      uint64_t DISABLE_ROUTE:1;
      uint64_t GLB_DSI_WR:1;
      uint64_t WR_CFG_OPT:1;
      uint64_t NC0:1;
      uint64_t SLEEP_TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QCLK_EN0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCEN_Q:8;
      uint64_t BCEN_Q:1;
      uint64_t GCH_WR_LO:1;
      uint64_t GCH_WR_HI:1;
      uint64_t DISABLE_ROUTE:1;
      uint64_t GLB_DSI_WR:1;
      uint64_t WR_CFG_OPT:1;
      uint64_t NC0:1;
      uint64_t SLEEP_TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QCLK_EN1;

};

#define UDB_UDB_BCTL0 (*(volatile struct UDB_UDB_BCTL0_tag *) 0x400f6000)

struct UDB_UDB_UDBIF_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIS_COR:1;
      uint64_t ROUTE_EN:1;
      uint64_t BANK_EN:1;
      uint64_t LOCK:1;
      uint64_t PIPE:1;
      uint64_t reservedSpace0:2;
      uint64_t GLBL_WR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BANK_CTL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RD_CFG_WAIT:2;
      uint64_t WR_CFG_WAIT:2;
      uint64_t RD_WRK_WAIT:2;
      uint64_t WR_WRK_WAIT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WAIT_CFG;

  uint8_t res0[26];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN_HFCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) INT_CLK_CTL;

};

#define UDB_UDB_UDBIF (*(volatile struct UDB_UDB_UDBIF_tag *) 0x400f7000)

struct CTBM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTB_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0_PWR_MODE:2;
      uint64_t OA0_DRIVE_STR_SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t OA0_COMP_EN:1;
      uint64_t OA0_HYST_EN:1;
      uint64_t OA0_BYPASS_DSI_SYNC:1;
      uint64_t reservedSpace1:1;
      uint64_t OA0_COMPINT:2;
      uint64_t reservedSpace2:1;
      uint64_t OA0_PUMP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA_RES0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA1_PWR_MODE:2;
      uint64_t OA1_DRIVE_STR_SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t OA1_COMP_EN:1;
      uint64_t OA1_HYST_EN:1;
      uint64_t OA1_BYPASS_DSI_SYNC:1;
      uint64_t reservedSpace1:1;
      uint64_t OA1_COMPINT:2;
      uint64_t reservedSpace2:1;
      uint64_t OA1_PUMP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA_RES1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0_COMP:1;
      uint64_t reservedSpace0:15;
      uint64_t OA1_COMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_STAT;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0_SET:1;
      uint64_t COMP1_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0_MASK:1;
      uint64_t COMP1_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0_MASKED:1;
      uint64_t COMP1_MASKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_MODE:3;
      uint64_t reservedSpace0:28;
      uint64_t DFT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFT_CTRL;

  uint8_t res1[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0P_A00:1;
      uint64_t reservedSpace0:1;
      uint64_t OA0P_A20:1;
      uint64_t OA0P_A30:1;
      uint64_t reservedSpace1:4;
      uint64_t OA0M_A11:1;
      uint64_t reservedSpace2:5;
      uint64_t OA0M_A81:1;
      uint64_t reservedSpace3:3;
      uint64_t OA0O_D51:1;
      uint64_t reservedSpace4:2;
      uint64_t OA0O_D81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA0_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0P_A00:1;
      uint64_t reservedSpace0:1;
      uint64_t OA0P_A20:1;
      uint64_t OA0P_A30:1;
      uint64_t reservedSpace1:4;
      uint64_t OA0M_A11:1;
      uint64_t reservedSpace2:5;
      uint64_t OA0M_A81:1;
      uint64_t reservedSpace3:3;
      uint64_t OA0O_D51:1;
      uint64_t reservedSpace4:2;
      uint64_t OA0O_D81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA0_SW_CLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA1P_A03:1;
      uint64_t OA1P_A13:1;
      uint64_t reservedSpace0:2;
      uint64_t OA1P_A43:1;
      uint64_t reservedSpace1:3;
      uint64_t OA1M_A22:1;
      uint64_t reservedSpace2:5;
      uint64_t OA1M_A82:1;
      uint64_t reservedSpace3:3;
      uint64_t OA1O_D52:1;
      uint64_t OA1O_D62:1;
      uint64_t reservedSpace4:1;
      uint64_t OA1O_D82:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA1_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA1P_A03:1;
      uint64_t OA1P_A13:1;
      uint64_t reservedSpace0:2;
      uint64_t OA1P_A43:1;
      uint64_t reservedSpace1:3;
      uint64_t OA1M_A22:1;
      uint64_t reservedSpace2:5;
      uint64_t OA1M_A82:1;
      uint64_t reservedSpace3:3;
      uint64_t OA1O_D52:1;
      uint64_t OA1O_D62:1;
      uint64_t reservedSpace4:1;
      uint64_t OA1O_D82:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA1_SW_CLEAR;

