iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/CY8C4245/emptyTargetInit/CY8C4245_sfr.h
  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t P2_HW_CTRL:1;
      uint64_t P3_HW_CTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTB_SW_HW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t OA0O_D51_STAT:1;
      uint64_t OA1O_D52_STAT:1;
      uint64_t OA1O_D62_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTB_SW_STATUS;

  uint8_t res3[3640];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0_OFFSET_TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA0_OFFSET_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0_SLOPE_OFFSET_TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA0_SLOPE_OFFSET_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA0_COMP_TRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA0_COMP_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA1_OFFSET_TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA1_OFFSET_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA1_SLOPE_OFFSET_TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA1_SLOPE_OFFSET_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OA1_COMP_TRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OA1_COMP_TRIM;

};

#define CTBM (*(volatile struct CTBM_tag *) 0x40100000)

struct SAR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t VREF_SEL:3;
      uint64_t VREF_BYP_CAP_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t NEG_SEL:3;
      uint64_t reservedSpace2:1;
      uint64_t SAR_HW_CTRL_NEGVREF:1;
      uint64_t PWR_CTRL_VREF:2;
      uint64_t SPARE:4;
      uint64_t reservedSpace3:4;
      uint64_t ICONT_LV:2;
      uint64_t reservedSpace4:2;
      uint64_t DSI_SYNC_CONFIG:1;
      uint64_t DSI_MODE:1;
      uint64_t SWITCH_DISABLE:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUB_RESOLUTION:1;
      uint64_t LEFT_ALIGN:1;
      uint64_t SINGLE_ENDED_SIGNED:1;
      uint64_t DIFFERENTIAL_SIGNED:1;
      uint64_t AVG_CNT:3;
      uint64_t AVG_SHIFT:1;
      uint64_t reservedSpace0:8;
      uint64_t CONTINUOUS:1;
      uint64_t DSI_TRIGGER_EN:1;
      uint64_t DSI_TRIGGER_LEVEL:1;
      uint64_t DSI_SYNC_TRIGGER:1;
      uint64_t reservedSpace1:11;
      uint64_t EOS_DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPLE_CTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMPLE_TIME0:10;
      uint64_t reservedSpace0:6;
      uint64_t SAMPLE_TIME1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPLE_TIME01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMPLE_TIME2:10;
      uint64_t reservedSpace0:6;
      uint64_t SAMPLE_TIME3:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPLE_TIME23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_LOW:16;
      uint64_t RANGE_HIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_THRES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RANGE_COND:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_COND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHAN_EN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FW_TRIGGER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) START_CTRL;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY_INC:1;
      uint64_t HIZ:1;
      uint64_t reservedSpace0:14;
      uint64_t DFT_INC:4;
      uint64_t DFT_OUTC:3;
      uint64_t reservedSpace1:1;
      uint64_t SEL_CSEL_DFT:4;
      uint64_t EN_CSEL_DFT:1;
      uint64_t DCEN:1;
      uint64_t reservedSpace2:1;
      uint64_t ADFT_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFT_CTRL;

  uint8_t res2[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t DIFFERENTIAL_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AVG_EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace4:17;
      uint64_t DSI_OUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_CONFIG07;

  uint8_t res3[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORK:16;
      uint64_t reservedSpace0:15;
      uint64_t CHAN_WORK_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK07;

  uint8_t res4[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SATURATE_INTR_MIR:1;
      uint64_t RANGE_INTR_MIR:1;
      uint64_t CHAN_RESULT_VALID_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT07;

  uint8_t res5[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHAN_WORK_VALID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_WORK_VALID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHAN_RESULT_VALID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_RESULT_VALID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUR_CHAN:5;
      uint64_t reservedSpace0:25;
      uint64_t SW_VREF_NEG:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUR_AVG_ACCU:20;
      uint64_t reservedSpace0:4;
      uint64_t CUR_AVG_CNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVG_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOS_INTR:1;
      uint64_t OVERFLOW_INTR:1;
      uint64_t FW_COLLISION_INTR:1;
      uint64_t DSI_COLLISION_INTR:1;
      uint64_t INJ_EOC_INTR:1;
      uint64_t INJ_SATURATE_INTR:1;
      uint64_t INJ_RANGE_INTR:1;
      uint64_t INJ_COLLISION_INTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOS_SET:1;
      uint64_t OVERFLOW_SET:1;
      uint64_t FW_COLLISION_SET:1;
      uint64_t DSI_COLLISION_SET:1;
      uint64_t INJ_EOC_SET:1;
      uint64_t INJ_SATURATE_SET:1;
      uint64_t INJ_RANGE_SET:1;
      uint64_t INJ_COLLISION_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOS_MASK:1;
      uint64_t OVERFLOW_MASK:1;
      uint64_t FW_COLLISION_MASK:1;
      uint64_t DSI_COLLISION_MASK:1;
      uint64_t INJ_EOC_MASK:1;
      uint64_t INJ_SATURATE_MASK:1;
      uint64_t INJ_RANGE_MASK:1;
      uint64_t INJ_COLLISION_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOS_MASKED:1;
      uint64_t OVERFLOW_MASKED:1;
      uint64_t FW_COLLISION_MASKED:1;
      uint64_t DSI_COLLISION_MASKED:1;
      uint64_t INJ_EOC_MASKED:1;
      uint64_t INJ_SATURATE_MASKED:1;
      uint64_t INJ_RANGE_MASKED:1;
      uint64_t INJ_COLLISION_MASKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SATURATE_INTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SATURATE_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SATURATE_SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SATURATE_INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SATURATE_MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SATURATE_INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SATURATE_MASKED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SATURATE_INTR_MASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_INTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_MASKED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_INTR_MASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOS_MASKED_MIR:1;
      uint64_t OVERFLOW_MASKED_MIR:1;
      uint64_t FW_COLLISION_MASKED_MIR:1;
      uint64_t DSI_COLLISION_MASKED_MIR:1;
      uint64_t INJ_EOC_MASKED_MIR:1;
      uint64_t INJ_SATURATE_MASKED_MIR:1;
      uint64_t INJ_RANGE_MASKED_MIR:1;
      uint64_t INJ_COLLISION_MASKED_MIR:1;
      uint64_t reservedSpace0:22;
      uint64_t SATURATE_MASKED_RED:1;
      uint64_t RANGE_MASKED_RED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INJ_PIN_ADDR:3;
      uint64_t reservedSpace0:1;
      uint64_t INJ_PORT_ADDR:3;
      uint64_t reservedSpace1:1;
      uint64_t INJ_DIFFERENTIAL_EN:1;
      uint64_t INJ_RESOLUTION:1;
      uint64_t INJ_AVG_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t INJ_SAMPLE_TIME_SEL:2;
      uint64_t reservedSpace3:16;
      uint64_t INJ_TAILGATING:1;
      uint64_t INJ_START_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INJ_CHAN_CONFIG;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INJ_RESULT:16;
      uint64_t reservedSpace0:12;
      uint64_t INJ_COLLISION_INTR_MIR:1;
      uint64_t INJ_SATURATE_INTR_MIR:1;
      uint64_t INJ_RANGE_INTR_MIR:1;
      uint64_t INJ_EOC_INTR_MIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INJ_RESULT;

  uint8_t res8[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX_FW_P0_VPLUS:1;
      uint64_t MUX_FW_P1_VPLUS:1;
      uint64_t MUX_FW_P2_VPLUS:1;
      uint64_t MUX_FW_P3_VPLUS:1;
      uint64_t MUX_FW_P4_VPLUS:1;
      uint64_t MUX_FW_P5_VPLUS:1;
      uint64_t MUX_FW_P6_VPLUS:1;
      uint64_t MUX_FW_P7_VPLUS:1;
      uint64_t MUX_FW_P0_VMINUS:1;
      uint64_t MUX_FW_P1_VMINUS:1;
      uint64_t MUX_FW_P2_VMINUS:1;
      uint64_t MUX_FW_P3_VMINUS:1;
      uint64_t MUX_FW_P4_VMINUS:1;
      uint64_t MUX_FW_P5_VMINUS:1;
      uint64_t MUX_FW_P6_VMINUS:1;
      uint64_t MUX_FW_P7_VMINUS:1;
      uint64_t MUX_FW_VSSA_VMINUS:1;
      uint64_t MUX_FW_TEMP_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSA_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSB_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSA_VMINUS:1;
      uint64_t MUX_FW_AMUXBUSB_VMINUS:1;
      uint64_t MUX_FW_SARBUS0_VPLUS:1;
      uint64_t MUX_FW_SARBUS1_VPLUS:1;
      uint64_t MUX_FW_SARBUS0_VMINUS:1;
      uint64_t MUX_FW_SARBUS1_VMINUS:1;
      uint64_t MUX_FW_P4_COREIO0:1;
      uint64_t MUX_FW_P5_COREIO1:1;
      uint64_t MUX_FW_P6_COREIO2:1;
      uint64_t MUX_FW_P7_COREIO3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_SWITCH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX_FW_P0_VPLUS:1;
      uint64_t MUX_FW_P1_VPLUS:1;
      uint64_t MUX_FW_P2_VPLUS:1;
      uint64_t MUX_FW_P3_VPLUS:1;
      uint64_t MUX_FW_P4_VPLUS:1;
      uint64_t MUX_FW_P5_VPLUS:1;
      uint64_t MUX_FW_P6_VPLUS:1;
      uint64_t MUX_FW_P7_VPLUS:1;
      uint64_t MUX_FW_P0_VMINUS:1;
      uint64_t MUX_FW_P1_VMINUS:1;
      uint64_t MUX_FW_P2_VMINUS:1;
      uint64_t MUX_FW_P3_VMINUS:1;
      uint64_t MUX_FW_P4_VMINUS:1;
      uint64_t MUX_FW_P5_VMINUS:1;
      uint64_t MUX_FW_P6_VMINUS:1;
      uint64_t MUX_FW_P7_VMINUS:1;
      uint64_t MUX_FW_VSSA_VMINUS:1;
      uint64_t MUX_FW_TEMP_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSA_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSB_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSA_VMINUS:1;
      uint64_t MUX_FW_AMUXBUSB_VMINUS:1;
      uint64_t MUX_FW_SARBUS0_VPLUS:1;
      uint64_t MUX_FW_SARBUS1_VPLUS:1;
      uint64_t MUX_FW_SARBUS0_VMINUS:1;
      uint64_t MUX_FW_SARBUS1_VMINUS:1;
      uint64_t MUX_FW_P4_COREIO0:1;
      uint64_t MUX_FW_P5_COREIO1:1;
      uint64_t MUX_FW_P6_COREIO2:1;
      uint64_t MUX_FW_P7_COREIO3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_SWITCH_CLEAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX_FW_P4_DFT_INP:1;
      uint64_t MUX_FW_P5_DFT_INM:1;
      uint64_t MUX_FW_ADFT0_SARBUS0:1;
      uint64_t MUX_FW_ADFT1_SARBUS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_SWITCH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX_FW_P4_DFT_INP:1;
      uint64_t MUX_FW_P5_DFT_INM:1;
      uint64_t MUX_FW_ADFT0_SARBUS0:1;
      uint64_t MUX_FW_ADFT1_SARBUS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_SWITCH_CLEAR1;

  uint8_t res9[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX_HW_CTRL_P0:1;
      uint64_t MUX_HW_CTRL_P1:1;
      uint64_t MUX_HW_CTRL_P2:1;
      uint64_t MUX_HW_CTRL_P3:1;
      uint64_t MUX_HW_CTRL_P4:1;
      uint64_t MUX_HW_CTRL_P5:1;
      uint64_t MUX_HW_CTRL_P6:1;
      uint64_t MUX_HW_CTRL_P7:1;
      uint64_t reservedSpace0:8;
      uint64_t MUX_HW_CTRL_VSSA:1;
      uint64_t MUX_HW_CTRL_TEMP:1;
      uint64_t MUX_HW_CTRL_AMUXBUSA:1;
      uint64_t MUX_HW_CTRL_AMUXBUSB:1;
      uint64_t reservedSpace1:2;
      uint64_t MUX_HW_CTRL_SARBUS0:1;
      uint64_t MUX_HW_CTRL_SARBUS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_SWITCH_HW_CTRL;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX_FW_P0_VPLUS:1;
      uint64_t MUX_FW_P1_VPLUS:1;
      uint64_t MUX_FW_P2_VPLUS:1;
      uint64_t MUX_FW_P3_VPLUS:1;
      uint64_t MUX_FW_P4_VPLUS:1;
      uint64_t MUX_FW_P5_VPLUS:1;
      uint64_t MUX_FW_P6_VPLUS:1;
      uint64_t MUX_FW_P7_VPLUS:1;
      uint64_t MUX_FW_P0_VMINUS:1;
      uint64_t MUX_FW_P1_VMINUS:1;
      uint64_t MUX_FW_P2_VMINUS:1;
      uint64_t MUX_FW_P3_VMINUS:1;
      uint64_t MUX_FW_P4_VMINUS:1;
      uint64_t MUX_FW_P5_VMINUS:1;
      uint64_t MUX_FW_P6_VMINUS:1;
      uint64_t MUX_FW_P7_VMINUS:1;
      uint64_t MUX_FW_VSSA_VMINUS:1;
      uint64_t MUX_FW_TEMP_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSA_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSB_VPLUS:1;
      uint64_t MUX_FW_AMUXBUSA_VMINUS:1;
      uint64_t MUX_FW_AMUXBUSB_VMINUS:1;
      uint64_t MUX_FW_SARBUS0_VPLUS:1;
      uint64_t MUX_FW_SARBUS1_VPLUS:1;
      uint64_t MUX_FW_SARBUS0_VMINUS:1;
      uint64_t MUX_FW_SARBUS1_VMINUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_SWITCH_STATUS;

  uint8_t res11[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLOCK_SEL:1;
      uint64_t reservedSpace0:30;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUMP_CTRL;

  uint8_t res12[2940];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_TRIM:3;
      uint64_t TRIMUNIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WOUND_RESOLUTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WOUNDING;

};

#define SAR (*(volatile struct SAR_tag *) 0x401a0000)

